Config/Documents/ПоступлениеМЗВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеМЗВПути</Name>
			<BasedOn>
				<xr:Item>Catalog.Договоры</xr:Item>
				<xr:Item>Document.РегистрацияОбязательствИСведенийПоДоговорам</xr:Item>
				<xr:Item>Document.ЭлектронныйДокументПоставщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РасшифровкаКУДиР</xr:Item>
				<xr:Item>AccumulationRegister.ОтражениеЭДВУчете</xr:Item>
				<xr:Item>AccumulationRegister.ИсполнениеОбязательствПоставщиками</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерПервичногоДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗачетаАванса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗачетаАвансов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументПоставщика</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятьНДСКВычету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВГрафикеИсполненияДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовКонтрольИсполненияДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятьНДСКВычетуУказываетсяВСтроках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписанияПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСКРаспределению</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПринятьНДСКВычету</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВозвратнаяТара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗачетАвансов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументАванса</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументАвансаПоставщикуПриПоступленииНФА</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗачета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДенежныеОбязательства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопКлассификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22_122</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5_105</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7_107</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ПоступлениеМЗВПути/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Установить условние оформление
	УправлениеМатериальнымиЗапасами.УстановитьУсловноеОформлениеПоляКЭК(УсловноеОформление,
		"МатериалыКЭК", "Материалы", "КЭК", "СчетУчета");
	УправлениеМатериальнымиЗапасами.УстановитьУсловноеОформлениеПоляКЭК(УсловноеОформление,
		"ВозвратнаяТараКЭК", "ВозвратнаяТара", "КЭК", "СчетУчета");
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// Инициализация данных формы, не зависящих от ключа объекта
	
	ЗаполнитьПараметрыВыбораСчетаУчета();
	
	ЗаполнитьТекстПроСчетФактуруСервер();
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	УчетНДС.УстановитьУсловноеОформлениеПолейНДСКРаспределению(УсловноеОформление, "Материалы");
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	ВидимостьЭлементовЭДОДляЭДПоставщика = ВидимостьЭлементовЭДОДляДокумента(Объект);
	ВидимостьЭлементовЭДО = ЭлектронныеДокументыБГУ.ВидимостьЭлементовЭДО(Объект.Контрагент, Объект.Организация);
	УстановитьВидимостьЭлементовЭДО(ЭтотОбъект, ВидимостьЭлементовЭДО, ВидимостьЭлементовЭДОДляЭДПоставщика);
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ДатаПодписанияПервичногоДокумента = Объект.Дата;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ВсегоПоДокументу = Объект.Материалы.Итог("Всего") + Объект.ВозвратнаяТара.Итог("Сумма");
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	УправлениеНФАКлиентСервер.ЗаполнитьСпособУчетаНДСВСтроках(Объект, Объект.Материалы);
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, ТекущийОбъект);
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	Оповестить("ДокументыПоУчетуМатериальныхЗапасовИзменение");

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораИзПодбораМЗ(ИсточникВыбора) Тогда
		ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение, ИсточникВыбора.ИмяТаблицы);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.КонтрольИсполненияДоговоров" Тогда
		Объект.ОтразитьВГрафикеИсполненияДоговора = ВыбранноеЗначение;
		КонтрольИсполненияДоговоровКлиент.УстановитьСтатусОтразитьДокументВГрафикеИсполнения(
			ЭтотОбъект, Объект.ОтразитьВГрафикеИсполненияДоговора);
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Запись_СчетФактураПолученный" Тогда
		ЗаполнитьТекстПроСчетФактуруКлиент(Параметр, Источник);
	КонецЕсли;

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	УправлениеНФА.ПроверитьЗаполнение(Объект, "Материалы", Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтотОбъект.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтотОбъект, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьДоговора(ЭтотОбъект);
	УстановитьДоступностьПодразделения(ЭтотОбъект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
	УстановитьДоступностьДоговора(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗачетаАвансаПриИзменении(Элемент)
	
	УчетРасчетовКлиент.СпособЗачетаАвансаПриИзменении(Элемент, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НадписьВалютаНДСНажатие(Элемент, СтандартнаяОбработка)
	
	// Старые значения (до изменения) запомним в кэше в локальных параметрах.
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	
	БухгалтерскийУчетКлиент.ПоказатьФормуВыбораТипаЦеныВалютыНДС(ЭтотОбъект, СтандартнаяОбработка,
		Новый ОписаниеОповещения("ПослеЗакрытияВыбораТипаЦеныВалютыНДС", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСчетФакутраНажатие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.СчетФактураНажатие(СчетФактура, ЭтотОбъект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	ВведенНаОснованииЭДП = Ложь;
	ЭлектронныеДокументыБГУКлиент.ОткрытьДокументОснованиеПоСсылкеСостояниеЭДО(ЭтотОбъект, Объект.Ссылка,
		СтандартнаяОбработка, ВведенНаОснованииЭДП, Объект.ДокументОснование);
		
	Если НЕ ВведенНаОснованииЭДП Тогда
		// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
		ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
		// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеЭДПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ЗаполнитьПоДокументуОснованию(Объект.ДокументОснование);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияДокументаДатаПроведенияПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы

&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
		ТекущиеДанные.Коэффициент = 1;
		ТекущиеДанные.КоличествоМест = 1;
		КоличествоСтрок = Объект.Материалы.Количество();
		Если КоличествоСтрок > 1 Тогда
			ПредыдущаяСтрока = Объект.Материалы[КоличествоСтрок-2];
			ТекущиеДанные.СтавкаНДС = ПредыдущаяСтрока.СтавкаНДС;
			ТекущиеДанные.КПС       = ПредыдущаяСтрока.КПС;
			ТекущиеДанные.КФО       = ПредыдущаяСтрока.КФО;
		Иначе
			ТекущиеДанные.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		КонецЕсли;
		УправлениеНФАКлиентСервер.УстановитьСпособУчетаНДСПоУмолчаниюВСтроке(Объект, Элементы.Материалы.ТекущиеДанные);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	ЗаполнитьДанныеНоменклатурыВСтроке(Элементы.Материалы.ТекущиеДанные, Объект, Истина);
КонецПроцедуры
 
&НаКлиенте
Процедура МатериалыКПСПриИзменении(Элемент)
	Если Элементы.Материалы.ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьКЭКНоменклатурыВСтроке(Элементы.Материалы.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКПСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Неопределено, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКПСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКФОПриИзменении(Элемент)
	Если Элементы.Материалы.ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьКЭКНоменклатурыВСтроке(Элементы.Материалы.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Неопределено, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКФООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаПриИзменении(Элемент)
	Если Элементы.Материалы.ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьКЭКНоменклатурыВСтроке(Элементы.Материалы.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Неопределено, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоМестПриИзменении(Элемент)
	ПересчитатьКоличество();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоэффициентПриИзменении(Элемент)
	ПересчитатьКоличество();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСтавкаНДСПриИзменении(Элемент)
	РасчитатьСтроку(Элементы.Материалы.ТекущиеДанные, Объект.СуммаВключаетНДС, "СтавкаНДС");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСуммаПриИзменении(Элемент)
	РасчитатьСтроку(Элементы.Материалы.ТекущиеДанные, Объект.СуммаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСуммаНДСПриИзменении(Элемент)
	РасчитатьСтроку(Элементы.Материалы.ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыВсегоПриИзменении(Элемент)
	РасчитатьСтроку(Элементы.Материалы.ТекущиеДанные, Объект.СуммаВключаетНДС, "Всего");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСпособУчетаНДСПриИзменении(Элемент)
	УправлениеНФАКлиентСервер.ЗаполнитьДанныеУчетаНДСПоСпособуУчета(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВозвратнаяТара

&НаКлиенте
Процедура ВозвратнаяТараПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элементы.ВозвратнаяТара.ТекущиеДанные;
		КоличествоСтрок = Объект.ВозвратнаяТара.Количество();
		Если КоличествоСтрок > 1 Тогда
			ПредыдущаяСтрока = Объект.ВозвратнаяТара[КоличествоСтрок-2];
			ТекущиеДанные.КПС = ПредыдущаяСтрока.КПС;
			ТекущиеДанные.КФО = ПредыдущаяСтрока.КФО;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараНоменклатураПриИзменении(Элемент)
	ЗаполнитьДанныеНоменклатурыВСтроке(Элементы.ВозвратнаяТара.ТекущиеДанные, Объект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараКПСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Неопределено, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараКПСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараКФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Неопределено, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараКФООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараСчетУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Неопределено, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараСчетУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗачетАвансов

&НаКлиенте
Процедура ЗачетАвансовДокументАвансаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УчетРасчетовКлиент.ДокументАвансаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовДокументАвансаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УчетРасчетовКлиент.ДокументАвансаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		ЭтотОбъект, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПринятьНДСКВычетуУказываетсяВСтроках(Команда)
	Объект.ПринятьНДСКВычетуУказываетсяВСтроках = Не Объект.ПринятьНДСКВычетуУказываетсяВСтроках;
	Если Объект.ПринятьНДСКВычетуУказываетсяВСтроках Тогда
		УстановитьПринятьНДСКВычетуВСтроках();
	КонецЕсли;
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПодборМЗ(Команда)
	
	УправлениеМатериальнымиЗапасамиКлиент.ОткрытьПодборМатериалов(ЭтотОбъект, Объект, "Материалы",
		ДополнитьСтруктуруПодбора("Материалы"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборТары(Команда)
	
	УправлениеМатериальнымиЗапасамиКлиент.ОткрытьПодборМатериалов(ЭтотОбъект, Объект, "ВозвратнаяТара",
		ДополнитьСтруктуруПодбора("ВозвратнаяТара"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансы(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Не заполнено обязательное поле ""Контрагент""'"),, "Объект.Контрагент");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Не заполнено обязательное поле ""Организация""'"),, "Объект.Организация");
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "";	
	Если Объект.ЗачетАвансов.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Табличная часть будет очищена.
		|'") ;
	КонецЕсли;
	Если Объект.Проведен Тогда
		ТекстВопроса = ТекстВопроса + НСтр("ru = 'Проведение документа будет отменено.
		|'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстВопроса) Тогда
		 ТекстВопроса = ТекстВопроса + НСтр("ru = 'Продолжить?'");
		 ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнениеТаблицыАвансыЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		 Возврат;
	КонецЕсли;	 
	
	ЗаполнитьАвансыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДО(Команда)
	
	Если Объект.Проведен Тогда
		
		ТекстВопроса = НСтр("ru = 'Перед заполнением денежных обязательств проведение документа будет отменено.
			|Продолжить?'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОтменитьПроведениеПередЗаполнениемДО", ЭтотОбъект),
			ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьДОНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДоговору(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСТр("ru = 'Не заполнено обязательное поле ""Договор""'"),,
			"Объект.Договор");
		Возврат;
	КонецЕсли;
	
	Если Объект.Материалы.Количество() > 0 Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьТаблицуПоДоговору", ЭтотОбъект),
			НСтр("ru = 'Существующие строки документа будут удалены. 
			|Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗаполнитьТаблицуПоДоговоруНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

// КонтрольИсполненияДоговоров
&НаКлиенте
Процедура Подключаемый_КонтрольИсполненияДоговоровПоказатьСтатус(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ДокументСсылка", Объект.Ссылка);
	ДопПараметры.Вставить("ОтразитьВГрафикеИсполнения", Объект.ОтразитьВГрафикеИсполненияДоговора);
	ДопПараметры.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	
	КонтрольИсполненияДоговоровКлиент.ПоказатьСтатусИсполнения(
		Объект.Организация, Объект.Контрагент, Объект.Договор, ДопПараметры, ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры
// Конец КонтрольИсполненияДоговоров

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольЦенПоДатеДокумента(Команда)
	
	РаботаСобязательствамиКлиент.ОбработатьКомандуКонтроляЦен(Объект.Дата, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольЦенПоДате(Команда)
	
	РаботаСобязательствамиКлиент.ОбработатьКомандуКонтроляЦен(Дата(1,1,1), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольЦенУбратьВыделение(Команда)

	РаботаСОбязательствамиКлиент.ОбработатьКомандуУбратьВыделениеКонтроляЦен(ЭтотОбъект, "Материалы");
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ТребуетсяВызовСервера = ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
		Или (Объект.ВалютаДокумента <> ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета
			И Не ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня)
		Или УправлениеМатериальнымиЗапасамиКлиентСервер.ИзменилосьПрименениеДетальногоКЭК340и440(
				ЭтотОбъект.КэшПараметров.Дата,
				ЭтотОбъект.КэшПараметров.Организация,
				Объект.Дата,
				Объект.Организация);
	
	Если ТребуетсяВызовСервера Тогда
		
		ДатаПриИзмененииНаСервере();
		
		БухгалтерскиеОперацииКлиент.ПоказатьОповещениеПриИзмененииКурсаВалюты(
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса,
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьВалютаДляКонтроляКурса);
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	КонецЕсли;

	УправлениеМатериальнымиЗапасами.ОбработатьИзменениеПримененияДетальногоКЭК340и440(ЭтотОбъект,
		ЭтотОбъект.КэшПараметров.Дата,
		ЭтотОбъект.КэшПараметров.Организация);
	
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВыбораТипаЦеныВалютыНДС(Результат, ДополнительныеПараметры) Экспорт

	Если ЭтотОбъект.КэшПараметров.ВалютаДокумента <> Объект.ВалютаДокумента Тогда
		БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.Локальные.СуммаВключаетНДС <> Объект.СуммаВключаетНДС Тогда
		СуммаВключаетНДСПриИзмененииНаСервере();
	КонецЕсли;
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура УстановитьПринятьНДСКВычетуВСтроках()
	
	УправлениеНФА.УстановитьПринятьНДСКВычетуВСтроках(Объект, Объект.Материалы);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	
	УстановитьДоступностьДоговора(ЭтотОбъект);
	УстановитьДоступностьПодразделения(ЭтотОбъект);
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	
	УчетРасчетовКлиентСервер.УправлениеЭлементамиЗачетаАвансов(ЭтотОбъект);
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
	УправлениеНФАКлиентСервер.ЗаполнитьСпособУчетаНДСВСтроках(Объект, Объект.Материалы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеТаблицыАвансыЗавершение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьАвансыНаСервере();	
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Функция ДополнитьСтруктуруПодбора(ИмяТаблицы)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ПоказыватьСчетУчета",	Истина);
	ТипыНоменклатуры = Новый СписокЗначений;
	Если ИмяТаблицы = "Материалы" Тогда
		ПараметрыПодбора.Вставить("ИмяТаблицы",				"Материалы");
	
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ГСМ"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Медикаменты"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МягкийИнвентарь"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Посуда"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПрочиеМЗ"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Стройматериалы"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Оборудование"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МолоднякИЖивотныеНаОткорме"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПродуктыПитания"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БСО"));		
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БиологическиеАктивы"));		
	Иначе
		ПараметрыПодбора.Вставить("ИмяТаблицы",				"ВозвратнаяТара");
		ПараметрыПодбора.Вставить("ПредставлениеТаблицы",	"Возвратная тара");
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Тара"));
	КонецЕсли;
	ПараметрыПодбора.Вставить("ТипыНоменклатуры",		ТипыНоменклатуры);
	ПараметрыПодбора.Вставить("Валюта",					Объект.ВалютаДокумента);
	ПараметрыПодбора.Вставить("ЕстьЦена",				Истина);
	ПараметрыПодбора.Вставить("ПоказыватьЦены",			Истина);
	ПараметрыПодбора.Вставить("ПодборМЗВПути",			Истина);
	Возврат ПараметрыПодбора;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДоговора(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Договор",
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация) И ЗначениеЗаполнено(Форма.Объект.Контрагент));

КонецПроцедуры
 
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьПодразделения(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Подразделение",
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация));

КонецПроцедуры // УстановитьДоступностьДоговора()

&НаКлиенте
Процедура ПересчитатьКоличество()

	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	ТекущиеДанные.Количество = ТекущиеДанные.КоличествоМест * ТекущиеДанные.Коэффициент;

КонецПроцедуры // ПересчитатьКоличество()

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатуры(Знач Параметры)
	
	ДанныеНоменклатуры = Новый Структура("ЕдиницаИзмерения, СчетУчета, КЭК, ТипНоменклатуры");
	
	СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Номенклатура, "ЕдиницаИзмерения, СчетУчета, ТипНоменклатуры");
	ДанныеНоменклатуры.ЕдиницаИзмерения = СтруктураДанных.ЕдиницаИзмерения;
	ДанныеНоменклатуры.СчетУчета = УправлениеМатериальнымиЗапасамиПовтИсп.СчетВПутиПоСчетуУчетаМЗ(СтруктураДанных.СчетУчета);
	ДанныеНоменклатуры.ТипНоменклатуры = СтруктураДанных.ТипНоменклатуры;
	
	ДанныеНоменклатуры.КЭК = ПолучитьКЭКНоменклатуры(Параметры, ДанныеНоменклатуры.СчетУчета, СтруктураДанных.ТипНоменклатуры);
	
	Возврат ДанныеНоменклатуры;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКЭКНоменклатуры(Знач Параметры, Знач СчетУчета, Знач ТипНоменклатуры)
	Возврат БухгалтерскийУчет.КЭКНоменклатуры(Параметры.Организация, Параметры.ИФО, Параметры.КФО,
		Параметры.Дата, СчетУчета, ТипНоменклатуры, "Дт");
КонецФункции

&НаКлиенте
Процедура ЗаполнитьКЭКНоменклатурыВСтроке(Строка)
	ПараметрыНоменклатуры = ПараметрыЗаполненияДанныхНоменклатуры(Объект, Строка);
	Строка.КЭК = ПолучитьКЭКНоменклатуры(ПараметрыНоменклатуры, Строка.СчетУчета, Строка.ТипНоменклатуры);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДанныеНоменклатурыВСтроке(Строка, Объект, ЗаполнятьСчет)

	ПараметрыНоменклатуры = ПараметрыЗаполненияДанныхНоменклатуры(Объект, Строка);
	ДанныеНоменклатуры = ПолучитьДанныеНоменклатуры(ПараметрыНоменклатуры);
	
	Если ЗаполнятьСчет Тогда
		ЗаполнитьЗначенияСвойств(Строка, ДанныеНоменклатуры);
	Иначе
		ЗаполнитьЗначенияСвойств(Строка, ДанныеНоменклатуры,,"СчетУчета");
	КонецЕсли;
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьТипНоменклатурыВСтрокеДляБиологическихАктивов(Строка, ДанныеНоменклатуры.ТипНоменклатуры);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыЗаполненияДанныхНоменклатуры(Объект, Строка)
	ПараметрыНоменклатуры = Новый Структура("Номенклатура, Организация, ИФО, КФО, Дата");
	ПараметрыНоменклатуры.Организация  = Объект.Организация;
	ПараметрыНоменклатуры.ИФО          = Объект.ИФО;
	ПараметрыНоменклатуры.КФО          = Строка.КФО;
	ПараметрыНоменклатуры.Дата         = Объект.Дата;
	ПараметрыНоменклатуры.Номенклатура = Строка.Номенклатура;
	Возврат ПараметрыНоменклатуры;
КонецФункции

&НаСервере
Процедура ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение,ИмяТЧ);
	
	СписокПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобраннойНоменклатурыВХранилище);
	
	КоличествоСтрок = Объект.Материалы.Количество();
	Если КоличествоСтрок > 1 Тогда
		ПредыдущаяСтрока = Объект.Материалы[КоличествоСтрок-1];
		ТекСтавкаНДС = ПредыдущаяСтрока.СтавкаНДС;
	Иначе
		ТекСтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли;

	Для Каждого ЭлементПодбора Из СписокПодбора Цикл
		Если ИмяТЧ = "Материалы" Тогда
			НоваяСтрока = Объект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ЭлементПодбора);
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.КоличествоМест = 1;
			НоваяСтрока.СтавкаНДС = ТекСтавкаНДС;
			УправлениеНФАКлиентСервер.УстановитьСпособУчетаНДСПоУмолчаниюВСтроке(Объект, НоваяСтрока);
			
			РасчитатьСтроку(НоваяСтрока, Объект.СуммаВключаетНДС, "Сумма");

		Иначе
			НоваяСтрока = Объект.ВозвратнаяТара.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ЭлементПодбора);
		КонецЕсли;
		ЗаполнитьДанныеНоменклатурыВСтроке(НоваяСтрока, Объект, НЕ ЗначениеЗаполнено(НоваяСтрока.СчетУчета));
		
	КонецЦикла;
	
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекстПроСчетФактуруКлиент(ПараметрОбработкиОповещения, ИсточникОбработкиОповещения)
	
	Перем ЗначениеСвойства;
	
	ЭтотДокументЯвляетсяОснованием = (ТипЗнч(ПараметрОбработкиОповещения) = Тип("Структура")
		И ПараметрОбработкиОповещения.Свойство("ДокументыОснования", ЗначениеСвойства)
		И ЗначениеСвойства.Найти(Объект.Ссылка) <> Неопределено);
	
	Если ЭтотДокументЯвляетсяОснованием Тогда
		ЗаполнитьТекстПроСчетФактуруСервер(ПараметрОбработкиОповещения, ИсточникОбработкиОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстПроСчетФактуруСервер(ПараметрОбработкиОповещения = Неопределено, ИсточникОбработкиОповещения = Неопределено)
	
	УчетНДС.ЗаполнитьТекстПроСчетФактуру(ЭтотОбъект, ПараметрОбработкиОповещения, ИсточникОбработкиОповещения);
	
КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьАвансыНаСервере()
	
	Отказ = Ложь;
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ПоВсемКФО", Истина);
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		ПараметрыЗаполнения.Вставить("ПериодОстатков",
			Новый Граница(КонецДня(ДокументОбъект.Дата), ВидГраницы.Включая) );
	Иначе
		ПараметрыЗаполнения.Вставить("ПериодОстатков",
			Новый Граница(ДокументОбъект.Ссылка.МоментВремени(), ВидГраницы.Исключая) );
	КонецЕсли;
	
	ДокументОбъект.ЗаполнитьПоОстаткамАвансов(ПараметрыЗаполнения, Отказ);
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Если НЕ Отказ Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОтменитьПроведениеПередЗаполнениемДО(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДОНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДОНаСервере()
	
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		ПериодОстатков = Новый Граница(КонецДня(ДокументОбъект.Дата), ВидГраницы.Включая);
	Иначе
		ПериодОстатков = Новый Граница(ДокументОбъект.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	
	ТаблицаОбязательств = УчетРасчетов.ДенежныеОбязательстваПоПоступлениюТРУ(ДокументОбъект, ПериодОстатков);
	
	Объект.ДенежныеОбязательства.Загрузить(ТаблицаОбязательств);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыВыбораСчетаУчета()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет107", БухгалтерскийУчет.СписокСчетов("107.00"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконто.Ссылка
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&Счет107)
	|	И ЕПСБУ.ЭлементГруппа = ЛОЖЬ
	|	И ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)";
	
	МассивСчетов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("ОграниченияСписокСчетов", Новый ФиксированныйМассив(МассивСчетов)));
	МассивПараметров.Добавить(Новый ПараметрВыбора("ВидСравненияВСписке", Истина));
	Элементы.МатериалыСчетУчета.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	Элементы.ВозвратнаяТараСчетУчета.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);

КонецПроцедуры // ЗаполнитьПараметрыВыбораСчетаУчета()

&НаСервере
Процедура ПересчитатьТабличнуюЧасть()
	Для Каждого СтрокаТЧ из Объект.Материалы Цикл
		РасчитатьСтроку(СтрокаТЧ, Объект.СуммаВключаетНДС, "Сумма");
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СуммаВключаетНДСПриИзмененииНаСервере()
	
	ПересчитатьТабличнуюЧасть();
	РассчитатьСуммуДокумента();

КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуДокумента()
	
	Объект.ВсегоПоДокументу = Объект.Материалы.Итог("Всего") + Объект.ВозвратнаяТара.Итог("Сумма");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РасчитатьСтроку(СтрокаТЧ, СуммаВключаетНДС, ИмяРеквизита)
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("СуммаВключаетНДС", СуммаВключаетНДС);
	УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтрокаТЧ, ИмяРеквизита, ПараметрыРасчета);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеСтрокиЦенаНДСВалюта(Форма)

	Объект = Форма.Объект;
	ПараметрыПредставления = БухгалтерскийУчетКлиентСервер.ПредставлениеСтрокиЦенаНДСВалюта_Параметры();
	ПараметрыПредставления.ВалютаДокумента = Объект.ВалютаДокумента;
	ПараметрыПредставления.ПринятьНДСКВычету = Объект.ПринятьНДСКВычету;
	ПараметрыПредставления.СуммаВключаетНДС = Объект.СуммаВключаетНДС;
	ПараметрыПредставления.ПринятьНДСКВычетуУказываетсяВСтроках = Объект.ПринятьНДСКВычетуУказываетсяВСтроках;
	ПараметрыПредставления.ПоказыватьНДС = Истина;
	ПараметрыПредставления.УчитыватьНДС = ПараметрыПредставления.ПоказыватьНДС;
	ПараметрыПредставления.ПоказыватьВалюту = Форма.КэшПараметров.ИспользоватьВалютныйУчет;
	
	Форма.НадписьВалютаНДС = БухгалтерскийУчетКлиентСервер.ПредставлениеСтрокиЦенаНДСВалюта(
		ПараметрыПредставления);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;

	ПринятьНДСКВычетуУказываетсяВСтроках = Объект.ПринятьНДСКВычетуУказываетсяВСтроках;
	ПринятьНДСКВычетуУказываетсяВШапке = Не Объект.ПринятьНДСКВычетуУказываетсяВСтроках;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МатериалыСпособУчетаНДС",
		"Видимость", ПринятьНДСКВычетуУказываетсяВСтроках);
	ЭлементыНДСКРаспределению = Новый Массив;
	ЭлементыНДСКРаспределению.Добавить("МатериалыНДСКРаспределению");
	ЭлементыНДСКРаспределению.Добавить("МатериалыТекстНДСКРаспределению");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыНДСКРаспределению,
		"Видимость", ПринятьНДСКВычетуУказываетсяВШапке);
	
	Элементы.ФормаПринятьНДСКВычетуУказываетсяВСтроках.Пометка = Объект.ПринятьНДСКВычетуУказываетсяВСтроках;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовЭДО(Форма, ВидимостьЭлементовЭДО, ВидимостьЭлементовЭДОДляЭДПоставщика)
	
	Если ВидимостьЭлементовЭДОДляЭДПоставщика Тогда
		ВидимостьЭлементовЭДО = Истина;
		Форма.Элементы.ДекорацияСостояниеЭДО.Заголовок = НСтр("ru='Отражение ЭД в учете'");
	Конецесли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ДекорацияСостояниеЭДО", "Видимость", ВидимостьЭлементовЭДО);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВидимостьЭлементовЭДОДляДокумента(Объект)
	Результат = Ложь;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицуПоДоговору(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуПоДоговоруНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПоДоговоруНаСервере()
	
	Объект.Материалы.Очистить();
	
	Документы.ПоступлениеМЗВПути.ЗаполнитьПоДоговору(Объект, Объект.Договор);

КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьПоДокументуОснованию(ДокументОснование)
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда 
		Если (Объект.Материалы.Количество() > 0) Тогда
			Возврат;
		КонецЕсли;	
		
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		ДокументОбъект.ЗаполнитьПоЭлектронномуДокументуПоставщика(ДокументОснование);
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	КонецЕсли;
КонецПроцедуры // ЗаполнитьПоДокументуОснованию()

&НаКлиенте
Процедура ПослеВводаДатыКонтроляЦен(ДатаКонтроля, ДопПараметры) Экспорт
	
	ДатаКонтроляЦен = ДатаКонтроля;
	
	Если ДатаКонтроляЦен = Неопределено Тогда
		ДатаКонтроляЦен = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "ДатаКонтроля");
	КонецЕсли;
	
	Если ДатаКонтроляЦен <> Неопределено Тогда
		ВыполнитьКонтрольЦен(ДатаКонтроляЦен);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКонтрольЦен(ДатаКонтроля)
	
	РаботаСОбязательствами.ВыполнитьКонтрольЦен(ДатаКонтроля, Объект, МассивСтрокКонтроляЦен, "Материалы");
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
